## Оконные функции
В данном блокноте демонстрируются решения задач из курса "Симулятор SQL" от Karpov.courses. В начале представлен код загрузки таблиц из csv в тестовую базу данных postgres.

In [6]:
import pandas as pd
from sqlalchemy import create_engine

In [7]:
!pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in c:\users\user\anaconda3\lib\site-packages (2.9.5)

In [8]:
# создаем подключение к базе данных
con_pg = create_engine('postgresql+psycopg2://rkmjfyhl:kjP-l6o6xLNX4XCWx5SxKoZZgEpT38h_@mouse.db.elephantsql.com/rkmjfyhl')

In [9]:
# загружаем данные в дф
courier_actions = pd.read_csv('courier_actions.csv')
couriers = pd.read_csv('couriers.csv')
orders = pd.read_csv('orders.csv')
products = pd.read_csv('products.csv')
user_actions = pd.read_csv('user_actions.csv')
users = pd.read_csv('users.csv')

In [10]:
# переводим колонки с датами в datetime, явно указывая формат
courier_actions['time'] = pd.to_datetime(courier_actions['time'], format='%d/%m/%y %H:%M')
couriers['birth_date'] = pd.to_datetime(couriers['birth_date'], format='%d/%m/%y')
orders['creation_time'] = pd.to_datetime(orders['creation_time'], format='%d/%m/%y %H:%M')
user_actions['time'] = pd.to_datetime(user_actions['time'], format='%d/%m/%y %H:%M')
users['birth_date'] = pd.to_datetime(users['birth_date'], format='%d/%m/%y')

In [11]:
# загружаем данные в тестовую базу
courier_actions.to_sql('courier_actions',con_pg, index=False, if_exists='replace')
couriers.to_sql('couriers',con_pg, index=False, if_exists='replace')
orders.to_sql('orders',con_pg, index=False, if_exists='replace')
products.to_sql('products',con_pg, index=False, if_exists='replace')
user_actions.to_sql('user_actions',con_pg, index=False, if_exists='replace')
users.to_sql('users',con_pg, index=False, if_exists='replace')

331

In [12]:
# создадим для удобства функцию для запросов
def select(query):
  return pd.read_sql(query, con_pg)

In [13]:
# проверка
query = '''
SELECT * FROM orders LIMIT 5
'''
select(query)

   order_id       creation_time       product_ids
0         1 2022-08-24 01:52:00          [65, 28]
1         2 2022-08-24 06:37:00  [35, 30, 42, 34]
2         3 2022-08-24 07:35:00      [24, 70, 77]
3         4 2022-08-24 10:39:00      [72, 40, 20]
4         5 2022-08-24 12:34:00              [48]

### Задание
Выведите кол-во заказов(учитывать, что есть отмененные) по дням. Для каждого дня вернуть результат сложения кол-ва заказов со значениями всех предыдущих записей.

In [14]:
query = '''
SELECT date,
       orders_count,
       sum(orders_count) OVER (ORDER BY date) as orders_cum_count
FROM   (SELECT date(creation_time) as date,
               count(order_id) as orders_count
        FROM   orders
        WHERE  order_id not in (SELECT order_id
                                FROM   user_actions
                                WHERE  action = 'cancel_order')
        GROUP BY date) t
'''

In [15]:
select(query).head()

         date  orders_count  orders_cum_count
0  2022-08-24           138             138.0
1  2022-08-25          1059            1197.0
2  2022-08-26          1447            2644.0
3  2022-08-27          2141            4785.0
4  2022-08-28          2998            7783.0

### Задание
Для каждого пользователя в таблице **user_actions** посчитайте порядковый номер каждого заказа.

In [16]:
query = '''
SELECT user_id,
       order_id,
       time,
       ROW_NUMBER() OVER(PARTITION BY user_id ORDER BY time) AS order_number
FROM user_actions
WHERE order_id not in (SELECT order_id
                    FROM user_actions
                    WHERE action = 'cancel_order')
'''
select(query).head()

   user_id  order_id                time  order_number
0        1         1 2022-08-24 01:52:00             1
1        1      4683 2022-08-27 20:56:00             2
2        1     22901 2022-09-02 00:58:00             3
3        1     23149 2022-09-02 02:36:00             4
4        2         2 2022-08-24 06:37:00             1

### Задание
Дополните запрос из предыдущего задания и с помощью оконной функции для каждого заказа каждого пользователя рассчитайте, сколько времени прошло с момента предыдущего заказа.

In [17]:
query = '''
SELECT user_id,
       order_id,
       time,
       row_number() OVER w as order_number,       
       (time - (lag(time) OVER w)) as time_diff
FROM   user_actions
WHERE  order_id not in (SELECT order_id
                        FROM   user_actions
                        WHERE  action = 'cancel_order')
Window w as (PARTITION BY user_id ORDER BY time)
ORDER BY user_id, order_number
'''
select(query).head()

   user_id  order_id                time  order_number       time_diff
0        1         1 2022-08-24 01:52:00             1             NaT
1        1      4683 2022-08-27 20:56:00             2 3 days 19:04:00
2        1     22901 2022-09-02 00:58:00             3 5 days 04:02:00
3        1     23149 2022-09-02 02:36:00             4 0 days 01:38:00
4        2         2 2022-08-24 06:37:00             1             NaT

### 7
Посчитайте, сколько в среднем времени проходит между заказами каждого пользователя. Результат вывести в часах и округлить. Отсеить пользователей с одним заказом.

In [18]:
query = '''
SELECT user_id,
       round(extract(epoch
FROM   avg(time_diff))/3600) as hours_between_orders
FROM   (SELECT user_id,
               order_id,
               time,
               time - lag(time, 1) OVER (PARTITION BY user_id
                                         ORDER BY time) as time_diff
        FROM   user_actions
        WHERE  order_id not in (SELECT order_id
                                FROM   user_actions
                                WHERE  action = 'cancel_order')) t
WHERE  time_diff is not null
GROUP BY user_id
ORDER BY user_id
'''
select(query).head()

   user_id  hours_between_orders
0        1                  72.0
1        2                 108.0
2        3                  64.0
3        4                  77.0
4        6                  11.0

### Задание
Сначала на основе таблицы orders сформируйте новую таблицу с общим числом заказов по дням. Затем посчитайте скользящее среднее числа заказов для каждой записи по трём предыдущим дням. Полученные значения скользящего среднего округлите до двух знаков после запятой.

In [19]:
query = '''
SELECT date,
       orders_count,
       round(avg(orders_count) OVER(ORDER BY date rows between 3 preceding and 1 preceding),
             2) moving_avg
FROM   (SELECT creation_time::date as date,
               count(order_id) orders_count
        FROM   orders
        WHERE  order_id not in (SELECT order_id
                                FROM   user_actions
                                WHERE  action = 'cancel_order')
        GROUP BY date) t
'''
select(query).head()

         date  orders_count  moving_avg
0  2022-08-24           138         NaN
1  2022-08-25          1059      138.00
2  2022-08-26          1447      598.50
3  2022-08-27          2141      881.33
4  2022-08-28          2998     1549.00

### Задание
Отметьте в отдельной таблице тех курьеров, которые доставили в сентябре заказов больше, чем в среднем все курьеры.

In [20]:
query = '''

SELECT courier_id,
    delivered_orders,
    ROUND(AVG(delivered_orders) OVER(), 2) avg_delivered_orders,
    (delivered_orders > AVG(delivered_orders) OVER())::int is_above_avg
FROM
    (SELECT courier_id,
            COUNT(order_id) AS delivered_orders
    FROM courier_actions
    WHERE action = 'deliver_order' AND
          DATE_TRUNC('MONTH', time)::date = '2022-09-01'
    GROUP BY courier_id) t
'''
select(query).head()

   courier_id  delivered_orders  avg_delivered_orders  is_above_avg
0           1                20                 13.76             1
1           2                14                 13.76             1
2           3                23                 13.76             1
3           4                 9                 13.76             0
4           5                23                 13.76             1

### Задание
Примените оконную функцию к таблице **products** и с помощью агрегирующей функции в отдельной колонке для каждой записи проставьте среднюю цену всех товаров. Колонку с этим значением назовите `avg_price`. Затем с помощью оконной функции и оператора **FILTER** в отдельной колонке рассчитайте среднюю цену товаров без учёта самого дорогого. Колонку с этим средним значением назовите `avg_price_filtered`. Полученные средние значения в колонках `avg_price` и `avg_price_filtered` округлите до двух знаков после запятой.

Выведите всю информацию о товарах, включая значения в новых колонках. Результат отсортируйте сначала по убыванию цены товара, затем по возрастанию id товара.

In [21]:
query = '''
SELECT product_id,
    name,
    price,
    ROUND(AVG(price) OVER(), 2) avg_price,
    ROUND(AVG(price) FILTER(WHERE price != (SELECT MAX(price) FROM products)) OVER(), 2) avg_price_filtered
FROM products
ORDER BY price DESC, product_id
'''
select(query).head()

   product_id              name  price  avg_price  avg_price_filtered
0          13              икра    800     133.54              125.79
1          37          баранина    559     133.54              125.79
2          15   масло оливковое    450     133.54              125.79
3          57           свинина    450     133.54              125.79
4          43  кофе без кофеина    400     133.54              125.79

### Задание
Для каждой записи в таблице **user_actions** с помощью оконных функций и предложения **FILTER** посчитайте, сколько заказов сделал и сколько отменил каждый пользователь на момент совершения нового действия.

Иными словами, для каждого пользователя в каждый момент времени посчитайте две накопительные суммы — числа оформленных и числа отменённых заказов. Если пользователь оформляет заказ, то число оформленных им заказов увеличивайте на 1, если отменяет — увеличивайте на 1 количество отмен.  
На основе этих двух колонок для каждой записи пользователя посчитайте показатель `cancel_rate`, т.е. долю отменённых заказов в общем количестве оформленных заказов. Значения показателя округлите до двух знаков после запятой.  
Текущее действие учитывается в подсчете сделанных и отмененных заказов.

In [22]:
query = '''
SELECT user_id,
       order_id,
       action,
       time,
       created_orders,
       canceled_orders,
       ROUND(canceled_orders * 1.0 / created_orders, 2) AS cancel_rate
FROM
    (SELECT user_id,
           order_id,
           action,
           time,
           COUNT(order_id) FILTER(WHERE action = 'create_order') OVER(PARTITION BY user_id ORDER BY time) created_orders,
           COUNT(order_id) FILTER(WHERE action = 'cancel_order') OVER(PARTITION BY user_id ORDER BY time) canceled_orders
    FROM user_actions) t
ORDER BY user_id, order_id, time
'''
select(query).head()

,user_id,order_id,action,time,created_orders,canceled_orders,cancel_rate
0,1,1,create_order,2022-08-24 01:52:00,1,0,0.0
1,1,4683,create_order,2022-08-27 20:56:00,2,0,0.0
2,1,22901,create_order,2022-09-02 00:58:00,3,0,0.0
3,1,23149,create_order,2022-09-02 02:36:00,4,0,0.0
4,2,2,create_order,2022-08-24 06:37:00,1,0,0.0

### Задание
Из таблицы **courier_actions** отберите топ 10% курьеров по количеству доставленных за всё время заказов. Выведите id курьеров, количество доставленных заказов и порядковый номер курьера в соответствии с числом доставленных заказов.

У курьера, доставившего наибольшее число заказов, порядковый номер должен быть равен 1, а у курьера с наименьшим числом заказов —  числу, равному десяти процентам от общего количества курьеров в таблице **courier_actions**.

In [23]:
query = '''
SELECT courier_id,
       orders_count,
       courier_rank
FROM
  (SELECT courier_id,
          COUNT(order_id) AS orders_count,
          rank() over(ORDER BY COUNT(order_id) DESC, courier_id) AS courier_rank
   FROM courier_actions
   WHERE action = 'deliver_order'
   GROUP BY courier_id) t1
WHERE courier_rank <=
    (SELECT round(count(DISTINCT courier_id) * 0.1)
     FROM courier_actions)'''
select(query).head()

   courier_id  orders_count  courier_rank
0         492            54             1
1         708            53             2
2          23            52             3
3         252            52             4
4         291            52             5

### Задание
С помощью оконной функции отберите из таблицы **courier_actions** всех курьеров, которые работают в нашей компании 10 и более дней. Также рассчитайте, сколько заказов они уже успели доставить за всё время работы.

Будем считать, что наш сервис предлагает самые выгодные условия труда и поэтому за весь анализируемый период ни один курьер не уволился из компании. Возможные перерывы между сменами не учитывайте — для нас важна только разница во времени между первым действием курьера и текущей отметкой времени. Текущей отметкой времени, относительно которой необходимо рассчитывать продолжительность работы курьера, считайте время последнего действия в таблице **courier_actions**. Учитывайте только целые дни, прошедшие с первого выхода курьера на работу (часы и минуты не учитывайте). 
В результат включите три колонки: id курьера, продолжительность работы в днях и число доставленных заказов. Две новые колонки назовите соответственно `days_employed` и `delivered_orders`. Результат отсортируйте сначала по убыванию количества отработанных дней, затем по возрастанию id курьера.

In [24]:
query = '''
SELECT * FROM
    (SELECT DISTINCT courier_id,
            DATE_PART('day', (select MAX(time) from courier_actions) - MIN(time) OVER(PARTITION BY courier_id)) AS days_employed,
            COUNT(order_id) FILTER(WHERE action = 'deliver_order') OVER(PARTITION BY courier_id) AS delivered_orders
    FROM courier_actions) t
WHERE days_employed >= 10
ORDER BY days_employed DESC, courier_id
'''
select(query).head()

   courier_id  days_employed  delivered_orders
0           1           15.0                45
1           2           15.0                35
2           3           15.0                45
3           5           15.0                43
4           7           15.0                40

### Задание
На основе информации в таблицах **orders** и **products** рассчитайте стоимость каждого заказа, ежедневную выручку сервиса и долю стоимости каждого заказа в ежедневной выручке, выраженную в процентах. В результат включите следующие колонки: id заказа, время создания заказа, стоимость заказа, выручку за день, в который был совершён заказ, а также долю стоимости заказа в выручке за день, выраженную в процентах.

При расчёте долей округляйте их до трёх знаков после запятой.

Результат отсортируйте сначала по убыванию даты совершения заказа (именно даты, а не времени), потом по убыванию доли заказа в выручке за день, затем по возрастанию id заказа.

При проведении расчётов отменённые заказы не учитывайте.  
Поскольку при загрузке данных в pandas `product_ids` преобразовался в строку, необходимо преобразование обратно в список.

In [25]:
query = '''
SELECT order_id,
       creation_time,
       order_price,
       sum(order_price) OVER(PARTITION BY date(creation_time)) daily_revenue,
       round(order_price * 1.0 / sum(order_price) OVER(PARTITION BY date(creation_time)) * 100,
             3) percentage_of_daily_revenue
FROM   (SELECT order_id,
               creation_time,
               sum(price) as order_price
        FROM   (SELECT order_id,
                       creation_time,
                       unnest(string_to_array(regexp_replace(product_ids, '[^\w^\s]', '', 'g'), ' ')::int[]) product_id
                FROM   orders
                WHERE  order_id not in (SELECT order_id
                                        FROM   user_actions
                                        WHERE  action = 'cancel_order')) o
            LEFT JOIN products p using(product_id)
        GROUP BY order_id, creation_time) t
ORDER BY date(creation_time) desc, percentage_of_daily_revenue desc, order_id
'''
select(query).head()

,order_id,creation_time,order_price,daily_revenue,percentage_of_daily_revenue
0,59374,2022-09-08 23:03:00,2014.0,2099508.0,0.096
1,55638,2022-09-08 09:45:00,1959.0,2099508.0,0.093
2,56492,2022-09-08 12:55:00,1946.0,2099508.0,0.093
3,56034,2022-09-08 11:13:00,1938.0,2099508.0,0.092
4,57957,2022-09-08 18:23:00,1927.0,2099508.0,0.092

### Задание
На основе информации в таблицах **orders** и **products** рассчитайте ежедневную выручку сервиса и отразите её в колонке `daily_revenue`. Затем с помощью оконных функций и функций смещения посчитайте ежедневный прирост выручки. Прирост выручки отразите как в абсолютных значениях, так и в % относительно предыдущего дня. Колонку с абсолютным приростом назовите `revenue_growth_abs`, а колонку с относительным — `revenue_growth_percentage`.

Для самого первого дня укажите прирост равным 0 в обеих колонках. При проведении расчётов отменённые заказы не учитывайте.  
Метрики daily_revenue, revenue_growth_abs, revenue_growth_percentage округлите до одного знака при помощи ROUND().

In [26]:
query = '''
SELECT date,
       sum(price) as daily_revenue,
       coalesce(round(sum(price) - lag(sum(price)) OVER w, 1),
                0.0) as revenue_growth_abs,
       coalesce(round((sum(price) - lag(sum(price)) OVER w) * 100.0 / lag(sum(price)) OVER w, 1),
                0.0) as revenue_growth_percentage
FROM   (SELECT unnest(string_to_array(regexp_replace(product_ids, '[^\w^\s]', '', 'g'), ' ')::int[]) product_id,
               date(creation_time) as date
        FROM   orders
        WHERE  order_id not in (SELECT order_id
                                FROM   user_actions
                                WHERE  action = 'cancel_order')) o
    LEFT JOIN products p using(product_id)
GROUP BY date window w as (
ORDER BY date)
'''
select(query).head()

         date  daily_revenue  revenue_growth_abs  revenue_growth_percentage
0  2022-08-24        49924.0                 0.0                        0.0
1  2022-08-25       430860.0            380936.0                      763.0
2  2022-08-26       534766.0            103906.0                       24.1
3  2022-08-27       817053.0            282287.0                       52.8
4  2022-08-28      1133370.0            316317.0                       38.7

### Задание
С помощью оконной функции рассчитайте медианную стоимость всех заказов из таблицы **orders**, оформленных в нашем сервисе. В качестве результата выведите одно число. Отменённые заказы не учитывайте.  
Встроенные функции для расчёта квантилей применять нельзя.

In [27]:
query = '''
WITH rank_order_price AS
  (SELECT order_id,
          sum(price) AS order_price,
          count(order_id) over() AS orders_count,
          row_number() over(
                            ORDER BY sum(price)) AS ROW
   FROM
     (SELECT order_id,
             unnest(string_to_array(regexp_replace(product_ids, '[^\w^\s]', '', 'g'), ' ')::int[]) product_id
      FROM orders
      WHERE order_id not in
          (SELECT order_id
           FROM user_actions
           WHERE action = 'cancel_order') ) o
   LEFT JOIN products p USING(product_id)
   GROUP BY order_id
   ORDER BY order_price)
   
SELECT avg(order_price) AS median_price
FROM rank_order_price
WHERE ROW BETWEEN ceil(orders_count / 2.0) AND ceil((orders_count + 1) / 2.0)
'''
select(query)

   median_price
0         321.0